/**
 * @author Zhou
 * @desc
 * @date 2024/8/3 9:40
 */
final public class GoodsList {
    private static String[] goodsInfo = {
            //消耗品清单
            "回生丹 XHP001 消耗品 100 有起死回生的效果",
            "琼玉膏 XHP002 消耗品 200 增加100生命值",
            "清平丸 XHP003 消耗品 300 增加100魔法值",
            "梅花汤饼 XHP004	消耗品 400 增加500魔法值",
            "佛泪 XHP005	消耗品 500 增加1000生命值",
            "独圣散 XHP006 消耗品 600 5秒内魔法免疫",
            "合荷散 XHP007 消耗品	700 提升回复魔法速度",
            "灵翼天香 XHP008 消耗品 800 提升回复生命速度",
            "益气散 XHP009 消耗品	900 5秒物理免疫",
            "冰梦 XHP010	消耗品 1000 10秒魔法免疫",

            //材料清单
            "冰珑石 CL001 材料 2000 用于合成混元珠",
            "冰莹石 CL002 材料 4000 用于合成紫檀",
            "冰玲石 CL003 材料 10000 用于合成紫竹泪",
            "冰晶石 CL004 材料 80000 用于合成麝香",
            "白骨石 CL005 材料 100000 用于合成玄参",
            "金沙 CL006 材料 200000 用于合成佛手玉",

            //装备清单
            "布衣裤 ZB001 装备 800 普通衣裤 1 2",
            "彩帛 ZB002 装备 1000 普通配饰 2 1",
            "缎面小帽 ZB003 装备 2000 普通帽子 5 4",
            "虎头鞋 ZB004 装备 5000 普通鞋子 7 2",
            "戒指 ZB005 装备 10000 未开光普通戒指 9 3",
            "宫装小套 ZB006 装备 20000 一级套装 6 1",

            //道具清单
            "香雨 DJ001 道具 0 任务道具 任务1道具",
            "米酒 DJ002 道具 0 任务道具 任务2道具",
            "三字经 DJ003 道具 0 任务道具 任务3道具",
            "玉骨扇 DJ004 道具 0 任务道具 任务4道具",
            "蜂蜜 DJ005 道具 0 任务道具 任务5道具",
            "广寒桂 DJ006 道具 0 任务道具 任务6道具",
            "轻纱 DJ007 道具 0 任务道具 任务7道具",
            "桑椹 DJ008 道具 0 任务道具 任务8道具",
            "相思子 DJ009 道具 0 任务道具 任务9道具",
            "云之石 DJ010 道具 0 任务道具 任务10道具",
    };


    private GoodsList() {

    }

    //获取指定物品信息
    public static String getGoodsInfo(String goods) {
        for (int i = 0; i < goodsInfo.length; ++i) {
            if (goodsInfo[i].indexOf(goods) != -1) {
                return goodsInfo[i];
            }
        }
        return null;
    }
}

